tsung.conf.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="1000" />
  </clients>

  <servers>
    <server host="catsocket.com" port="4000" type="tcp" />
  </servers>

  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users maxnumber="1000" arrivalrate="50" unit="second" />
    </arrivalphase>
  </load>

  <sessions>
    <session name="websocket" probability="100" type="ts_websocket">
      <request>
        <websocket type="connect" path="/b/ws"></websocket>
      </request>

      <!-- <request subst="true"> -->
      <!--   <websocket type="message"> -->
      <!--     {"id":"%%ts_user_server:get_unique_id%%","data":{},"action":"identify","user":"%%ts_user_server:get_unique_id%%","api_key":"b766496f&#45;34b0&#45;4967&#45;8c14&#45;7534dc57d38d","timestamp":1487272100649} -->
      <!--   </websocket> -->
      <!-- </request> -->
      <!--  -->
      <!-- <thinktime value="1"/> -->
      <!--  -->
      <!-- <request subst="true"> -->
      <!--   <websocket type="message"> -->
      <!--     {"id":"%%ts_user_server:get_unique_id%%","data":{"room":"chat"},"action":"join","user":"","api_key":"b766496f&#45;34b0&#45;4967&#45;8c14&#45;7534dc57d38d","timestamp":1487272780355} -->
      <!--   </websocket> -->
      <!-- </request> -->

      <for var="i" from="1" to="1000" incr="1">
        <thinktime value="30"/>
      </for>
    </session>
  </sessions>
</tsung>